Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: JUGA TIAP MAU
en: through the same thing

source: EH…?!
en: huh?!

source: Ciak terjepit
en: a chick was trapped

source: gak apa-apa rad?
en: are you okay?

source: BELOM PADA
en: why haven’t they

source: TEMPAT SURVEY
en: too far

source: Masih nggak bisa dibuka ini pintunya?
en: the door hasn’t been fixed yet?

source: Tapi bukannya lo nggak bisa nyetir mobil gue…?
en: I thought you couldn’t drive my car!

source: DIA UDAH NGELARIN MASALAHNYA SAMA RADI, DIA JUGA UDAH NGELARIN SALAH PAHAM DIA SAMA GUE!!!
en: she worked things out with radi, and she also worked things out with me!!!

source: KAMU KENAPA SIH KOK DIEM AJA?!
en: hey, why the long face?!

source: DHUG!
en: thud

source: PULANG
en: up after

source: MASIH DI BULAN
en: next month.

source: EH IYA
en: oh,

source: SIDANG AJA,
en: with her thesis.

source: BRRT
en: bzzt

source: KALAU TERNYATA MEMANG
en: when I know I was the one

source: Ya udah, mereka nggak peduli apakah gue bahagia atau nggak.
en: they didn’t care whether I was happy or not.

source: WALAUPUN DIA BILANG DIA NGGAK BISA NGENDALIIN DIRINYA SENDIRI… TAPI SAAT DIA NGOMONG KAYAK GINI…
en: even though she said she couldn’t control herself, when she told me about these things...

source: KATANYA ITU JUGA KARYA TUGAS AKHIR, TAPI NGGAK KUNJUNG DIAMBIL PEMILIKNYA…
en: I heard those ceramics were also a final project piece, but the artist hasn’t picked them up yet.

source: buku adekmu banyak juga ya...
en: she has lots of books, I see...

source: KEMANA?
en: where to?

source: TAPI PADA NGGAK TAHU APA-APA MEREKA… SUSAH JUGA YA…
en: however, I didn’t get any clues from them. they said they had no idea.

source: BUAGH
en: pow

source: CUMA BERANTEM
en: they were just

source: SAMA KERJAAN
en: with this sort of

source: AJA SOAL
en: maya

source: Soalnya gua nggak nyaman, gua butuh kejelasan dari lu, apa lu bakal terus kayak gini ke gua?
en: because I’m not, maya. please, enlighten me. how long are you planning to keep treating me like this?

source: MAAF YA TIBA-TIBA…
en: um, sorry about the other day.

source: Tok Tok!
en: knock knock

source: JIIIITT
en: peek

source: KE SINI SAYA
en: the only way for me

source: SIA… KITTY BENERAN NYARIIN GUE KE KAMPUS?!!!
en: shoot... kitty really tracked me down on campus!

source: Halo?
en: hello?

source: DITERIMA DI PTN,
en: getting accepted into college,

source: SAMA AJE.
en: one bit.

source: MAY, MAY SINI DIKIT.
en: maya, come closer.

source: DAN KEGUNDAHAN
en: and

source: MASIIH!!!
en: yeah, he is!

source: tadi masbin ke sini, cuma katanya nggak enak ganggu neng ayu, trus nitip ini juga ke saya.
en: bintang dropped by. he didn’t want to disturb you, so he asked me to bring you this instead.

source: Kalo Radi nggak nyaman… Radi bisa tinggalin saya… Saya nggak apa-apa…
en: if you’re not okay with this, you can leave me... and I’ll let you go.

source: Eh… Iya ma…
en: oh... I did.

source: KATANYA
en: I heard

source: CUMA SOAL LIMBAH AIR 'KAN?!!
en: isn’t it all just about water waste?!

source: INI TULISAN TUGAS
en: it’s my final paper.

source: Sama mau sekalian saya coba benerin pintunya…?
en: oh, and I can fix that door for you if you want.

source: ITU JUGA RADI
en: radi have been

source: LAPOR NY
en: report this to--

source: Rad… gue bisa minta waktu lo sebentar?
en: radi... do you have a minute?

source: Dan mama bisa percaya lagi sama saya.
en: I want her to have faith in me once again.

source: Lagian ngobrolin apaan sih lama banget?!
en: what the hell were you two talking about anyway?!

source: SETELAH KAMU
en: after you’re done

source: KERETA
en: my

source: PERNAH NGELAKUIN
en: have you brought me

source: DEH....
en: together.

source: TA-mu piye? belok kelayakan ‘kan?
en: what about your project? the test is tomorrow, right?

source: DONG YA BUAT
en: I need my glasses

source: ALASAN
en: I’ve

source: HAHH… IYA JUGA SIH, PADAHAL WAKTU ITU JORDAN YANG NEMENIN GUE NYARIIN RADI…
en: come to think of it, jordan was the one who helped me find radi...

source: Teman-teman banyak
en: many animals came

source: ANAKNYA
en: speak of

source: AMAT YOLA.
en: know?

source: Nakal, namun
en: was a bully, but

source: SELAMA INI?
en: this group, huh?

source: KAMI MALAH MEMBURUK...
en: in our relationship.

source: INI...
en: it.

source: TUMBEN,
en: tsk...

source: BERANGKAT
en: when will

source: sama katanya, dia teh hari ini mau cuti kuliah.
en: oh, he also said that he was going to take a year off.

source: Rad… gue bisa minta waktu lo sebentar…?
en: radi... do you have a minute?

source: bego banget.
en: I’m such a fool.

source: SAMPAI RASANYA KALUT SENDIRI.
en: it’s like... I’m quarreling with my own thoughts.

source: TAPI EMANGNYA DOSBING KAMU BOLEHIN NGULANG?
en: but is it okay with your advisor if you start over?

source: LHA KOK RESPONNYA GITU?!
en: why don’t you say anything, at least?

source: MASALAH GUE
en: worse,

source: TEMPAT-TEMPAT
en: if you wandered off

source: TRUS
en: now she

source: TADINYA
en: he said

source: ISXXXXX
en: 15xxxxx

source: COSPLAY?
en: doing a cosplay, huh?

source: MASIH LAMA
en: the train departs

source: GUE NGANDELIN
en: I asked

source: BAE?!
en: wouldn’t budge!

source: MUNGKIN KALO SAYA
en: if I didn’t,

source: APA SIH LO RAD SOK-SOK UNKNOWN NUMBER?!
en: you think you’re so cool calling me from an unknown number, huh?!

source: KEMAREN
en: oh, I found

source: SAYA...
en: about everything...

source: jadi tadi sekalian pulang ke surabaya, langsung ke bandara tadi pagi.
en: he said he had a plane to catch, so I asummed he was returning to surabaya.

source: SAYA MASIH
en: I’m still

source: INI TUGAS AKHIR AKU!
en: my final project!

source: LO.
en: of you.

source: SEMUANYA SESUAI
en: was by

source: LAPORIN INI KE
en: to the teachers.

source: BODYGUARD
en: your bodyguard

source: UDAH YA,
en: okay, then,

source: MINTA
en: really

source: PADA NGIRA JORDAN
en: that it was jordan, right?

source: Tapi makasih udah ngasih gua kesempatan buat jelasin ini semua ke lu…
en: but thank you for giving me a chance to explain everything to you...

source: BENER-BENER
en: want to

source: SURVEY TUGAS AKHIR,
en: a field observation.

source: NAK?
en: going

source: TA kamu gimana?! aduh bintang kamu ada-ada aja deh kalo bertindak suka nggak mikir?!!!
en: what about your final project, bintang?! god, I’ve had it with you! you should’ve thought about this before!

source: Dimana JAMES?
en: But where was James?

source: lho? halo ras? udah dimakan bingkisanku?
en: hello, laras! did you like the gift?

source: TERTEKAN...
en: her...

source: kesempatan ini nggak boleh saya sia-siakan, jangan sampe ada kesempatan ke tiga, ke dua aja cukup.
en: after all, this is my second chance. I don’t want to fail again. there will be no other chances.

source: GUE KABUR
en: I ran away

source: BODYGUARD GUE
en: my bodyguard

source: Kartika Maya, 3 Juli (tahun lahirnya sama)
en: kartika maya, july 3 (same year of birth)

source: MUNGKIN
en: ...all of

source: KALAU KAMU TAKUT, BILANG AJA KAMU TAKUT.
en: if you’re afraid, just tell her that you’re afraid.

source: SELALU UNTUK ORANG LAIN.
en: we always do what is best for our partners.

source: KLONTANG!
en: clank

source: Dari kecil cuma dirawat sama asisten, tapi menuntut banyak hal padahal ketemu pun cuma seminggu sekali.
en: my nanny was the only one who took care of me when I was a kid. even though my parents and I only met once a week, they were extremely demanding of me.

source: kayaknya harus bikin alternatif... tapi ini udah 3 alternatif...
en: seems like I need to find more alternatives... but I’ve found three already...

source: KARENA KAMU
en: because you’ll enjoy

source: EMANGNYA JURNALNYA BAHAS APAAN SIH?!!
en: what the heck is this journal about,

source: Panggilan
en: attention, passengers

source: NGGAK TAU MAU
en: because she didn’t know

source: MAU DI GALERI
en: at the hidayat’s

source: SEBAGAI SEORANG
en: I just couldn’t stop

source: ta-tapi bu...! saya selama itu juga udah membedah semua isinya!
en: b-but I’ve gone over the entire thesis several times!

source: SEBULANAN
en: about

source: Say-
en: baby--

source: HAL KAYAK
en: this

source: SIAP AJA BUAT
en: I’m just

source: JURUSANNYA...
en: in my major.

source: Silakan
en: please enjoy your meal

source: UH… WAKTU BERES-BERESIN KAMAR KAMU, MAMA NEMU FOTO ITU DALEM TAS KAMU, TRUS DIA MINTA KAK AIS BUAT BINGKAI FOTO INI.
en: mom cleaned your room and found that picture in your bag. she asked me to frame it after that.

source: EH IYA, BARU INGET, DIA NGELOCK DM TWOTTERNYA JUGA…
en: oh, I almost forgot, he also locked his private messages on twitter.

source: BODYGUARD!!!
en: a bodyguard!

source: OOOH...
en: oh, I see...

source: MEMILIH
en: chosen

source: JADI YA,
en: so, yeah...

source: Gue cuma minta satu hal, apa pun yang bakal lo lakuin ke depannya, tolong pikirin dampaknya…
en: I just want to ask you one thing. no matter what you’re planning to do in the future, you still have to consider the consequences.

source: COBA DI
en: okay, then,

source: SAMPAI ANAK
en: at least until

source: TAPI SYUKURLAH...
en: I guess I’m kinda

source: DIA NGAKK PUNYA JAM TERTENTU GITU YA BUAT BALES-BALES EMAIL?
en: isn’t there a timeframe on when he can answer his emails?

source: sejak kejadian itu... bintang gak pernah...
en: ever since that... bintang has never...

source: umm... mungkin bukan ‘rasa’, tapi ada sesuatu yang kamu simpen soal radi.
en: well, maybe not “feelings” per se, but there’s gotta be something, right?

source: UDAH, KAMU TENANG YA…
en: it’s gone. don’t worry, okay?

source: YAAAH!!
en: oh nooo...

source: Penulisan tugas akhir kamu masih kurang, yang ini dibenerin aja.
en: a few changes are still needed in your thesis proposal. you can omit this part.

source: HARUS DIAMBIL
en: so, we need to pick

source: TIKETNYA...?
en: this.

source: DARI SURVEY
en: some field observation

source: JANGAN BILANG LO SEBENERNYA DIPASANGIN ALAT PELACAK?
en: don’t tell me he has a tracking device on you.

source: DULU LO PENGEN
en: were little, you always

source: BIKIN HATI
en: so excited,

source: Sini ikut saya ke Neng Ayu!
en: come in, let me take you to laras.

source: *grogi*
en: *nervous*

source: GUE...
en: so I came here

source: ADA YANG
en: has something

source: YANG PENTING SAYA PULANG SEBELUM JAM MALAM KOSAN.
en: as long as you take me home before midnight.

source: INI.
en: this!

source: MINAT SAMA
en: interested

source: JAM 9 PAGI… TAPI KALAU KEPAGIAN DI KAMU NGGAK USAH DATENG NGGAK APA-APA KOK…
en: at 9 in the morning. but it’s fine if you think it’s too early for you to come, though.

source: SAYANG-SAYANG SIPATOKAAN, MATEGO TEGO GOROKAN SAYANG~
en: baby duck, doo, doo, doo, doo, doo, doo~

source: Rupanya
en: James

source: WAH, ITU
en: is

source: JADI MAKE SENSE NGGAK SIH?
en: so, it makes sense, right?

source: GUE NGGAK ADA WAKTU LAGI… GIMANA KALO GUE NANTI GAK BAKAL KETEMU LAGI?
en: you know, I’m running out of time... and I’m worried I won’t get another chance to see him.

source: PENCET INI-EH, BUKAN…
en: should we push this? I don’t think so...

source: NGGAK TAU, GUE LEBIH CURIGA KENAPA LARAS NYARIIN RADI?
en: no idea, but what intrigues me more is the reason behind laras’s search for radi.

source: YUK.
en: yeah.

source: hah...?
en: what?

source: SAMA JORDAN.
en: like that.

source: JGLEG!
en: clack

source: DAN LAGI
en: plus,

source: EH TAPI
en: but radi said

source: PERTIMBANGAN
en: still much to be

source: Sekarang kamu bakal fokus skripsi?
en: now, you can focus more on your thesis, can’t you?

source: BEGINI?
en: like this?

source: SUKA DEH
en: don’t know

source: MAAF… AKU CUMA… KEPIKIRAN KAMU DAN RADI…
en: uh, sorry... I was just... thinking about you and radi.

source: LULUS SEKOLAH,
en: my graduation,

source: Aneh lo!!
en: you weirdo!

source: itu adalah kebetulan semata dan tidak ada unsur kesengajaan.
en: is purely coincidental.

source: Selagi bisa sekarang, kenapa harus ditunda, nak?
en: what’s the point in waiting until later? we can do it now, can’t we?

source: BANGET JADI
en: wanted to be

source: NANTI HUBUNGAN
en: I didn’t want put a strain

source: Ruri punya bukunya nggak ya?
en: I wonder if ruri still has the book.

source: Lagian lo apaan juga sih kabur bawa duit bokap, dipake buat modal bikin café, bayarin orang kerja sama lo, 'kan bukan duit lo.
en: huff... this is what you get for running away with your dad’s money, dummy! tsk... you said you wanted to open a cafe, hire people to work for you... news flash! that’s not your money!

source: YA RAD?
en: with your girl?

source: YA KALO MAU SEPI KAMU SEWA AJA TROTOARNYA.
en: rent the sidewalk if you don’t want anyone else to be here.

source: KEBAHAGIAAN, JIMAT
en: happiness,

source: WOI
en: hey,

source: LARAS JUGA UDAH SAYA MAAFKAN KOK.
en: I’ve also forgiven you, laras.

source: DUAGH
en: whack

source: DUH...
en: what’s taking

source: SEKOLAH!
en: school!

source: HAHAHA IYA
en: I see where you’re coming from.

source: LAIN AJA!!!
en: you doofus!

source: PENGEN FOKUS
en: focus

source: KERJAAN BIKIN
en: was in fact

source: mama harus tau...
en: ...I should tell her.

source: tapi semua itu kamu peroleh karena kamu selesaikan semuanya sendiri.
en: but you’ve got all of that because you’ve always worked by yourself.

source: aku tau kamu lagi kesasar sama perasaan kamu sendiri, makanya kamu butuh kepastian ‘kan?
en: I know that you’re caught up in your feelings and need some closure.

source: DIMANA PUN LOKASINYA
en: where you do it,

source: LAMA BANGET...
en: here!

source: BLAM!
en: slam

source: DULU?
en: first?

source: YAH… ALASAN LAINNYA KAK AIS NGGAK TAU SIH… INI TEBAKAN KAK AIS AJA.
en: I mean, I guess that’s why.

source: INI YANG HARUS
en: I’ve got to deal with

source: UDAH TAU APA,
en: what drives you,

source: sotboy: soto boyolali
en: *soto is a traditional Indonesian soup mainly composed of broth, meat, and vegetables.

source: NGGAK BENER AJA,
en: really put much thought

source: BUAT BIKIN SAYA
en: just so I could

source: Selain mau ngambil mantel, lo ada perlu apa lagi?
en: let’s be honest, why are you here?

source: RAD?
en: depart, radi?

source: DUDUK TAPI
en: to wait for the train,

source: Mulanya gue pikir, dengan gue mengutarakan ini semua, gue bakal lebih lega…
en: I thought if I told him everything, I would be at peace.

source: DIKENALIN
en: did you

source: LAGI TIDUR.
en: now.

source: SAMPAI DIA
en: in the end,

source: Silakan tanda tangan di sini ya, Pak.
en: please sign here, sir.

source: IYAAA!
en: okay!

source: Sepertinya mama mengetahui sesuatu…
en: I think mom knows something.

source: -DEBAR...
en: going to burst!

source: Lama banget?!!
en: what took them so long?!

source: INI NGGAK BISA
en: we’ve got to do something

source: MAU NANYA APA LAGI SOAL RADI?
en: what else do you want to know about radi?

source: nggak usah ma adek bisa sendiri, semuanya aman kok.
en: don’t worry, mom. I can take care of it. everything will be taken care of.

source: DARI TOILET...
en: forever.

source: KAMU BUTUH
en: anyway, you’ll need

source: SRAK
en: rustle

source: NAK...
en: thesis.

source: aku sedih banget tau huhuhu....
en: I’m so sad, you know?!

source: SEKARANG KITA UDAH DI MALL, MAU KEMANA, MAY?
en: where do you want to go now that we’re at the mall?

source: Tapi kenapa malah… menyisakan rasa yang pelik?
en: but... why’s there a bitter feeling in my heart?

source: Mama nggak perlu repot-
en: why are we doing this--

source: NGGAK?
en: okay?

source: MASA
en: did they

source: SAYA DI SINI SAMA RADI, NGGAK USAH TAKUT.
en: I’m here for you. don’t be afraid.

source: BIAR KAMU
en: I want to

source: PERCAYA LAGI
en: trust her

source: Nih, pake mantel gue dulu!
en: here, put on my coat!

source: LO UDAH BIKIN IMEJ
en: that you’ve ruined

source: haduuuuuuuh!!! kamu lagi!!! udah aku bilang aku nggak tau maya dimana!!!
en: what?! you again?! how many times do I have to tell you? I don’t know where maya is!!!

source: ngulang skripsi?!!!
en: what? you have to start over?!

source: APA?!
en: recently?!

source: loh? ngapain adekmu punya buku soal keramik? mama baru liat?
en: huh? she has a pottery book? I’ve never seen it before.

source: Apaan sih Im just kidding!
en: oh, come on... I’m just messing with you.

source: BU CERITANYA,
en: story.

source: NGEBUKTIIN
en: to prove herself

source: KITA EMANG SUKA KELIRU SAMA SEBUAH HUBUNGAN PACARAN.
en: we often have the wrong idea of what a relationship is.

source: DIBUANG...
en: throw it away.

source: HATI!
en: restlessness!

source: GUE NGGAK
en: I never told

source: BUKANNYA MAMA BAKAL MARAH KALO TAU SAYA PACARAN…?
en: wasn’t she supposed to be angry to learn that I had a boyfriend?

source: NGGAK TAU
en: that he was going

source: IBU
en: what

source: UDAH NEMENIN
en: and chatting

source: NGAPAIN...
en: what to do...

source: GUE NGGAK PUNYA
en: I don’t

source: Kamu liat Radi ng-
en: have you seen radi...

source: YA UDAH, JALAN-JALAN DI DALAM MALL JUGA NGGAK MASALAH.
en: it wouldn’t be a bad idea to just walk around the mall.

source: UKH… IYA, TENANG… CICAKNYA UDAH NGGAK ADA KOK.
en: calm down, it’s gone.

source: kak ais lupa maya nggak suka pedes...
en: I forgot you didn’t like spicy food.

source: MENIKMATINYA!
en: every step of it!

source: Nggak, beda.
en: what? no!

source: JUGA.
en: to take.

source: SAMA SAYA
en: suit me,

source: bicara
en: to her

source: Selamat malam, tuan.
en: good evening, sir.

source: NGGAK BISA NEMUIN
en: so much difficulties

source: LIAT LU BABAK BELUR
en: dragging you around

source: dan pembibitan
en: & greenery.

source: JAM BERAPA
en: your train

source: DAH CECAA!
en: I’ll see you later!

source: HALOOOOOOOOOOO
en: Hellooooooooooo

source: saya jahat banget sama diri sendiri...
en: I’m so cruel to myself...

source: KENAPA MAMA NGGAK MARAH..
en: why wasn’t she angry with me?

source: LO PASTI PAHAM APA YANG BAKAL TERJADI NANTI KALO LO TERUS-TERUSAN KAYAK GINI.
en: I bet you know what’s gonna happen if you keep acting like this.

source: HARUS NGERASA
en: owing a favor

source: KOK MALAH
en: I’ve

source: kali ini saya bakal coba pelan-pelan, nggak buru-buru.
en: I’m gonna take my time. no need to rush.

source: AH MUNGKIN DIA SADAR TEMPAT KARENA INI LAGI DI PERPUS.
en: oh, he might be quieter because we’re in the library.

source: SEBENTAR
en: it won’t

source: GITU KELAS 3
en: ew...

source: UDAH REDA,
en: has stopped.

source: TUAN CUMA JATOH,
en: in such severe injuries.

source: CTAK CTIK CTAK
en: clack clack clack

source: WAH LARAAS!!
en: it’s laras!

source: hah?
en: huh?

source: Iya Pak nanti saya tambahin.
en: okay, sir. I’ll revise it as soon as possible.

source: KATANYA DIA EMANG JARANG NGUMPUL AMA YANG LAIN.
en: well, I don’t remember him hanging out with others very often.

source: Oke, aku bakal nolongin kamu.
en: fine, I’ll help you.

source: LEBIH DARI 3
en: than three days,

source: TAPI ITU JUGA TERJADI KARENA SAYA SENDIRI… ORANG YANG BERMASALAH.
en: however, I was also the cause of my own downfall.

source: BISA GAMPANG
en: be able to keep

source: BARANG BAWAAN
en: but I’ve got my luggage

source: Kenapa nih kok nggak nyala?!!
en: why won’t it start?!

source: KE SIDANGKU
en: you can come

source: AH IYA...
en: oh, sure...

source: Kita ke Pasar Baru, nyari kain buat kebaya wisudaan kamu nanti!
en: let’s go shopping for your graduation attire in the pasar baru shopping district!

source: MANA ADA
en: what?

source: HARUS TERJUN
en: that I had to conduct

source: MAU SIDANG
en: thesis defense

source: LU DI DEPAN
en: for you

source: BARUSAN...
en: about such a thing.

source: DIDATENGIN!?
en: do that?

source: DIAMBIL, BISA
en: they’ll

source: SETDAH GALAK AMAT HAHA.
en: man, what’s with the angry face? haha

source: NGOMONG APA SIH, NGACO.
en: what are you blabbering about?

source: MAAF...
en: sorry--

source: DULUAN YA!
en: you later, okay?

source: sehebat apa sih kamu sampai bisa menanggung sendiri?!!
en: is it too much for you to ask for help?!

source: BUKAAN,
en: no!

source: BODO AMAT
en: screw

source: GUE MALAH
en: he asked me

source: MAMA NGGAK
en: I don’t think so.

source: DI BEKASI.
en: by the evening.

source: Datang lagiii, ayo masuk-masuk, Neng Ayu lagi di kamar!
en: another visitor? hahaha! come in, come in! laras is in her room.

source: umm... ya apa boleh buat, ruri...
en: well... it can’t be helped.

source: KALIAN PADA
en: you boys,

source: BERNAUNG...
en: to stay.

source: hobi baca maya dari dulu nggak berubah ya...
en: I guess her hobby hasn’t really changed.

source: Eh mama udah ditungguin Linda di luar...
en: okay, then. oh, linda is waiting for me.

source: DULU SERING
en: I used

source: DAN CUMA MAMPU
en: so, they decided

source: PAMER KEKAYAAN
en: you’d be bragging

source: SAYA NGGAK MAU NGINEO, BESOK HARUS LANJUTIN SKRIPSI.
en: I’m going home now because I have to keep working on my thesis.

source: Apa kita emang seharusnya putus aja…?
en: do we... really have to break up?

source: episode 74 Tapi Apakah Menjadi Kembali
en: will things go back to how they were?

source: BEGITU PIKIR SAYA…
en: that’s what I was thinking...

source: TUAN, BERI TAU
en: sir, please tell me

source: DARIPADA MEMILIH BUAT KABUR, MAYA MILIH BUAT MENGHADAPI KERUMITAN YANG ADA DI DIRINYA SENDIRI…
en: instead of running away, she decided to face her own complexities.

source: SOK BANGET DEH?!
en: what is he trying to pull?!

source: SERIUSAN?!!
en: you sure?!

source: STASIUN
en: station

source: ‘tinung’ gitu...
en: and it makes a sound like, “dun.”

source: Maya wisudanya masih lama!
en: I won’t graduate anytime soon!

source: NGGAK SEMUA YANG KAMU TAKUTI ITU SEPERTI YANG KAMU BAYANGKAN.
en: you shouldn’t be afraid of everything you think you’re afraid of.

source: episode 56 Sesuatu Yang Tertinggal
en: episode 56 something left behind

source: SAYA MAU TOTALITAS
en: I want to give my all

source: KASIAN YAH
en: I feel sorry for laras.

source: BARU KITA
en: we’ll just go

source: umm... itu... maya waktu itu cerita, selama dia nggak ngerjain skripsi, maya ikut mata kuliah keramik pilihan di fakultas seni rupa...
en: oh... she told me that when she wasn’t working on her thesis, she took a ceramic course at the faculty of art and design.

source: UDAH PINDAH
en: that radi

source: ASLI KELAKUAN
en: you guys

source: YAAH… NGGAK BISA DIBILANG KABUR JUGA SIH…
en: well, I can’t say I’m avoiding it.

source: huhuhu T___T
en: okay... T___T

source: KAMU NYARI
en: to travel

source: APAAN SIH DIEM AJA?!
en: just say something!

source: SEAGNKATAN SAMA
en: in the same batch

source: KRAUK KRAUK
en: crisp crisp

source: TERLALU FOKUS
en: too focused

source: TEMENIN
en: could you

source: TOPIKNYA...
en: new thesis.

source: NANTI SAYA
en: I’ll let

source: NGGAK
en: fine,

source: KAK AIS MAU GROBFOOD NIH, MAYA MAU MAKAN APA?!
en: do you want anything to eat? I’m ordering takeout.

source: Apa besok saya minta jadwal bimbingan langsung aja ya?
en: maybe I should schedule a meeting with my advisor tomorrow.

source: GIMANA?
en: so, what do you say?

source: ABISIN.
en: finish this.

source: KALO MAU BACA NIH SILAKAN, AKU BISA BACA NANTI.
en: you can read it here if you want to. I can read it later on.

source: AKU NITIP LAPTOP YA.
en: I’m leaving my laptop here.

source: Tumben, biasanya Mas Bin yang ke sini.
en: bintang usually visits her whenever she’s sick.

source: POLOSAN RP.
en: clothing materials

source: APAAN SIH...
en: give me a break...

source: KERAMIK
en: student’s

source: GOSIP SOAL
en: the gossips

source: Tapi sebelum hiatus, author kasih oleh-oleh dulu ya, karena kalian pasti kangen sama mereka
en: but before that, I’d like to give you all a present! here you go! I know all of you have missed them, right?!

source: ZREK!
en: whirr

source: NGEREPOTIN,
en: for lending me a hand.
